Return-Path: <linux-kernel-owner@vger.kernel.org>
X-Original-To: lists+linux-kernel@lfdr.de
Delivered-To: lists+linux-kernel@lfdr.de
Received: from vger.kernel.org (vger.kernel.org [23.128.96.18])
	by mail.lfdr.de (Postfix) with ESMTP id 4288236F3F6
	for <lists+linux-kernel@lfdr.de>; Fri, 30 Apr 2021 04:16:50 +0200 (CEST)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
        id S229831AbhD3CRY (ORCPT <rfc822;lists+linux-kernel@lfdr.de>);
        Thu, 29 Apr 2021 22:17:24 -0400
Received: from mga12.intel.com ([192.55.52.136]:50274 "EHLO mga12.intel.com"
        rhost-flags-OK-OK-OK-OK) by vger.kernel.org with ESMTP
        id S229577AbhD3CRW (ORCPT <rfc822;linux-kernel@vger.kernel.org>);
        Thu, 29 Apr 2021 22:17:22 -0400
IronPort-SDR: 5vahKbqt4JEIfZvYuHPgoob+fDrddvdphh0mYY6xJMe9BQVSJaWc/29eXb/ynJozeQx4iVLfvM
 bSoufhR6Chpw==
X-IronPort-AV: E=McAfee;i="6200,9189,9969"; a="176656363"
X-IronPort-AV: E=Sophos;i="5.82,260,1613462400"; 
   d="xz'?yaml'?scan'208";a="176656363"
Received: from orsmga008.jf.intel.com ([10.7.209.65])
  by fmsmga106.fm.intel.com with ESMTP/TLS/ECDHE-RSA-AES256-GCM-SHA384; 29 Apr 2021 19:16:33 -0700
IronPort-SDR: in9eAQFVDPeYBDIfkU7R+vAKxW595QKDgF2tTEDXaLJgdjZGdiA7qclzHkxieJ3S1y5a8Fz6QY
 /Ggw+sCtLF2A==
X-IronPort-AV: E=Sophos;i="5.82,260,1613462400"; 
   d="xz'?yaml'?scan'208";a="431191718"
Received: from xsang-optiplex-9020.sh.intel.com (HELO xsang-OptiPlex-9020) ([10.239.159.140])

# udp rx:   1696 MB/s  1236224 calls/s
# udp tx:   2491 MB/s    42252 calls/s  42252 msg/s
# udp gso zerocopy
# udp rx:   1627 MB/s  1186048 calls/s
# udp tx:   2208 MB/s    37457 calls/s  37457 msg/s
# udp tx:   2222 MB/s    37691 calls/s  37691 msg/s
# udp rx:   1642 MB/s  1197056 calls/s
# udp tx:   2217 MB/s    37618 calls/s  37618 msg/s
# udp gso timestamp
# udp rx:   1680 MB/s  1224448 calls/s
# udp tx:   2248 MB/s    38142 calls/s  38142 msg/s
# udp tx:   2258 MB/s    38311 calls/s  38311 msg/s
# udp rx:   1691 MB/s  1232640 calls/s
# udp tx:   2263 MB/s    38398 calls/s  38398 msg/s
#
not ok 18 selftests: net: udpgso_bench.sh # TIMEOUT 45 seconds
# selftests: net: fib_rule_tests.sh
# 
# ######################################################################
# TEST SECTION: IPv4 fib rule
# ######################################################################
# 
#     TEST: rule4 check: oif dummy0                             [ OK ]
# 
#     TEST: rule4 del by pref: oif dummy0                       [ OK ]
# net.ipv4.ip_forward = 1
# net.ipv4.conf.dummy0.rp_filter = 0
# 
#     TEST: rule4 check: from 192.51.100.3 iif dummy0           [ OK ]
# 
#     TEST: rule4 del by pref: from 192.51.100.3 iif dummy0     [ OK ]
# net.ipv4.ip_forward = 0
# 
#     TEST: rule4 check: tos 0x10                               [ OK ]
# 
#     TEST: rule4 del by pref: tos 0x10                         [ OK ]
# 
#     TEST: rule4 check: fwmark 0x64                            [ OK ]
# 
#     TEST: rule4 del by pref: fwmark 0x64                      [ OK ]
# 
#     TEST: rule4 check: uidrange 100-100                       [ OK ]
# 
#     TEST: rule4 del by pref: uidrange 100-100                 [ OK ]
# 
#     TEST: rule4 check: sport 666 dport 777                    [ OK ]
# 
#     TEST: rule4 del by pref: sport 666 dport 777              [ OK ]
# 
#     TEST: rule4 check: ipproto tcp                            [ OK ]
# 
#     TEST: rule4 del by pref: ipproto tcp                      [ OK ]
# 
#     TEST: rule4 check: ipproto icmp                           [ OK ]
# 
#     TEST: rule4 del by pref: ipproto icmp                     [ OK ]
# 
# ######################################################################
# TEST SECTION: IPv6 fib rule
# ######################################################################
# 
#     TEST: rule6 check: oif dummy0                             [ OK ]
# 
#     TEST: rule6 del by pref: oif dummy0                       [ OK ]
# 
#     TEST: rule6 check: from 2001:db8:1::3 iif dummy0          [ OK ]
# 
#     TEST: rule6 del by pref: from 2001:db8:1::3 iif dummy0    [ OK ]
# 
#     TEST: rule6 check: tos 0x10                               [ OK ]
# 
#     TEST: rule6 del by pref: tos 0x10                         [ OK ]
# 
#     TEST: rule6 check: fwmark 0x64                            [ OK ]
# 
#     TEST: rule6 del by pref: fwmark 0x64                      [ OK ]
# 
#     TEST: rule6 check: uidrange 100-100                       [ OK ]
# 
#     TEST: rule6 del by pref: uidrange 100-100                 [ OK ]
# 
#     TEST: rule6 check: sport 666 dport 777                    [ OK ]
# 
#     TEST: rule6 del by pref: sport 666 dport 777              [ OK ]
# 
#     TEST: rule6 check: ipproto tcp                            [ OK ]
# 
#     TEST: rule6 del by pref: ipproto tcp                      [ OK ]
# 
#     TEST: rule6 check: ipproto ipv6-icmp                      [ OK ]
# 
#     TEST: rule6 del by pref: ipproto ipv6-icmp                [ OK ]
# 
# Tests passed:  32
# Tests failed:   0
ok 19 selftests: net: fib_rule_tests.sh
# selftests: net: msg_zerocopy.sh
# ipv4 tcp -t 1
# tx=152797 (9535 MB) txc=0 zc=n
# rx=76399 (9535 MB)
# ipv4 tcp -z -t 1
# tx=121918 (7608 MB) txc=121918 zc=n
# rx=60960 (7608 MB)
# ok
# ipv6 tcp -t 1
# tx=143882 (8978 MB) txc=0 zc=n
# rx=71941 (8978 MB)
# ipv6 tcp -z -t 1
# tx=115844 (7229 MB) txc=115844 zc=n
# rx=57923 (7229 MB)
# ok
# ipv4 udp -t 1
# tx=161435 (10074 MB) txc=0 zc=n
# rx=160452 (10012 MB)
# ipv4 udp -z -t 1
# tx=109255 (6817 MB) txc=109255 zc=n
# rx=109255 (6817 MB)
# ok
# ipv6 udp -t 1
# tx=156624 (9773 MB) txc=0 zc=n
# rx=156624 (9773 MB)
# ipv6 udp -z -t 1
# tx=111254 (6942 MB) txc=111254 zc=n
# rx=111254 (6942 MB)
# ok
# OK. All tests passed
ok 20 selftests: net: msg_zerocopy.sh
# selftests: net: psock_snd.sh
# dgram
# tx: 128
# rx: 142
# rx: 100
# OK
# 
# dgram bind
# tx: 128
# rx: 142
# rx: 100
# OK
# 
# raw
# tx: 142
# rx: 142
# rx: 100
# OK
# 
# raw bind
# tx: 142
# rx: 142
# rx: 100
# OK
# 
# raw qdisc bypass
# tx: 142
# rx: 142
# rx: 100
# OK
# 
# raw vlan
# tx: 146
# rx: 100
# OK
# 
# raw vnet hdr
# tx: 152
# rx: 142
# rx: 100
# OK
# 
# raw csum_off
# tx: 152
# rx: 142
# rx: 100
# OK
# 
# raw csum_off with bad offset (expected to fail)
# ./psock_snd: write: Invalid argument
# raw min size
# tx: 42
# rx: 0
# OK
# 
# raw mtu size
# tx: 1514
# rx: 1472
# OK
# 
# raw mtu size + 1 (expected to fail)
# ./psock_snd: write: Message too long
# raw vlan mtu size + 1 (expected to fail)
# ./psock_snd: write: Message too long
# dgram mtu size
# tx: 1500
# rx: 1472
# OK
# 
# dgram mtu size + 1 (expected to fail)
# ./psock_snd: write: Message too long
# raw truncate hlen (expected to fail: does not arrive)
# tx: 14
# ./psock_snd: recv: Resource temporarily unavailable
# raw truncate hlen - 1 (expected to fail: EINVAL)
# ./psock_snd: write: Invalid argument
# raw gso min size
# tx: 1525
# rx: 1473
# OK
# 
# raw gso min size - 1 (expected to fail)
# tx: 1524
# rx: 1472
# OK
# 
not ok 21 selftests: net: psock_snd.sh # exit=1
# selftests: net: udpgro_bench.sh
# ipv4
# tcp - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# tcp tx:    901 MB/s    15295 calls/s  15295 msg/s
# tcp rx:    904 MB/s    30547 calls/s
# tcp tx:    846 MB/s    14358 calls/s  14358 msg/s
# tcp rx:    847 MB/s    28684 calls/s
# tcp tx:   1080 MB/s    18333 calls/s  18333 msg/s
# tcp rx:   1081 MB/s    36661 calls/s
# tcp tx:   1060 MB/s    17983 calls/s  17983 msg/s
# udp gso - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# udp rx:    640 MB/s   456548 calls/s
# udp tx:    706 MB/s    11975 calls/s  11975 msg/s
# udp rx:    715 MB/s   509452 calls/s
# udp tx:    713 MB/s    12104 calls/s  12104 msg/s
# udp rx:    714 MB/s   508880 calls/s
# udp tx:    714 MB/s    12124 calls/s  12124 msg/s
# udp rx:    719 MB/s   512442 calls/s
# udp tx:    717 MB/s    12172 calls/s  12172 msg/s
# udp gso and gro - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# udp rx:    907 MB/s    15392 calls/s
# udp tx:   1033 MB/s    17534 calls/s  17534 msg/s
# udp rx:   1011 MB/s    17159 calls/s
# udp tx:   1007 MB/s    17086 calls/s  17086 msg/s
# udp rx:   1014 MB/s    17211 calls/s
# udp tx:   1016 MB/s    17238 calls/s  17238 msg/s
# udp rx:   1009 MB/s    17118 calls/s
# udp tx:   1006 MB/s    17075 calls/s  17075 msg/s
# ipv6
# tcp - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# tcp tx:    846 MB/s    14359 calls/s  14359 msg/s
# tcp rx:    847 MB/s    28562 calls/s
# tcp tx:   1066 MB/s    18089 calls/s  18089 msg/s
# tcp rx:   1067 MB/s    36168 calls/s
# tcp tx:   1120 MB/s    18997 calls/s  18997 msg/s
# tcp rx:   1121 MB/s    38008 calls/s
# tcp tx:   1105 MB/s    18746 calls/s  18746 msg/s
# udp gso - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# udp rx:    700 MB/s   510963 calls/s
# udp tx:    776 MB/s    13178 calls/s  13178 msg/s
# udp rx:    778 MB/s   567995 calls/s
# udp tx:    777 MB/s    13193 calls/s  13193 msg/s
# udp rx:    771 MB/s   562561 calls/s
# udp tx:    770 MB/s    13060 calls/s  13060 msg/s
# udp rx:    770 MB/s   561588 calls/s
# udp tx:    769 MB/s    13056 calls/s  13056 msg/s
# udp gso and gro - over veth touching data
# Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# udp rx:    927 MB/s    15723 calls/s
# udp tx:   1013 MB/s    17194 calls/s  17194 msg/s
# udp rx:    976 MB/s    16559 calls/s
# udp tx:    980 MB/s    16630 calls/s  16630 msg/s
# udp rx:    980 MB/s    16622 calls/s
# udp tx:    973 MB/s    16514 calls/s  16514 msg/s
# udp rx:    968 MB/s    16433 calls/s
# udp tx:    967 MB/s    16412 calls/s  16412 msg/s
ok 22 selftests: net: udpgro_bench.sh
# selftests: net: udpgro.sh
# ipv4
#  no GRO                                  Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  no GRO chk cmsg                         Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO                                     Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO chk cmsg                            Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO with custom segment size            Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO with custom segment size cmsg       Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  bad GRO lookup                          Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  multiple GRO socks                      Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
# ipv6
#  no GRO                                  Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  no GRO chk cmsg                         Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO                                     Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO chk cmsg                            Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO with custom segment size            Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  GRO with custom segment size cmsg       Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  bad GRO lookup                          Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
#  multiple GRO socks                      Continuing without mounted eBPF fs. Too old kernel?
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       549
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 257
# btf_total_size: 549
# [1] PTR (anon) type_id=2
# [2] STRUCT xdp_md size=24 vlen=6
# 	data type_id=3 bits_offset=0
# 	data_end type_id=3 bits_offset=32
# 	data_meta type_id=3 bits_offset=64
# 	ingress_ifindex type_id=3 bits_offset=96
# 	rx_queue_index type_id=3 bits_offset=128
# 	egress_ifindex type_id=3 bits_offset=160
# [3] TYPEDEF __u32 type_id=4
# [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [5] FUNC_PROTO (anon) return=6 args=(1 ctx)
# [6] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [7] FUNC xdp_dummy_prog type_id=5
# [8] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
# [9] ARRAY (anon) type_id=8 index_type_id=10 nr_elems=4
# [10] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [11] VAR _license type_id=9 linkage=1
# [12] DATASEC license size=0 vlen=1 size == 0
# 
# ok
ok 23 selftests: net: udpgro.sh
# selftests: net: test_vxlan_under_vrf.sh
# Checking HV connectivity                                           [ OK ]
# Check VM connectivity through VXLAN (underlay in the default VRF)  [ OK ]
# Check VM connectivity through VXLAN (underlay in a VRF)            [FAIL]
not ok 24 selftests: net: test_vxlan_under_vrf.sh # exit=1
# selftests: net: reuseport_addr_any.sh
# UDP IPv4 ... pass
# UDP IPv6 ... pass
# UDP IPv4 mapped to IPv6 ... pass
# TCP IPv4 ... pass
# TCP IPv6 ... pass
# TCP IPv4 mapped to IPv6 ... pass
# DCCP not supported: skipping DCCP tests
# SUCCESS
ok 25 selftests: net: reuseport_addr_any.sh
# selftests: net: test_vxlan_fdb_changelink.sh
# expected two remotes after fdb append	[ OK ]
# expected two remotes after link set	[ OK ]
ok 26 selftests: net: test_vxlan_fdb_changelink.sh
# selftests: net: so_txtime.sh
# 
# SO_TXTIME ipv4 clock monotonic
# payload:a delay:56 expected:0 (us)
# 
# SO_TXTIME ipv6 clock monotonic
# payload:a delay:136 expected:0 (us)
# 
# SO_TXTIME ipv6 clock monotonic
# payload:a delay:10382 expected:10000 (us)
# 
# SO_TXTIME ipv4 clock monotonic
# payload:a delay:10387 expected:10000 (us)
# payload:b delay:20095 expected:20000 (us)
# 
# SO_TXTIME ipv6 clock monotonic
# payload:b delay:20363 expected:20000 (us)
# payload:a delay:20407 expected:20000 (us)
# 
# SO_TXTIME ipv4 clock tai
# send: pkt a at -1619666528139ms dropped: invalid txtime
# ./so_txtime: recv: timeout: Resource temporarily unavailable
# 
# SO_TXTIME ipv6 clock tai
# send: pkt a at 0ms dropped: invalid txtime
# ./so_txtime: recv: timeout: Resource temporarily unavailable
# 
# SO_TXTIME ipv6 clock tai
# payload:a delay:9988 expected:10000 (us)
# 
# SO_TXTIME ipv4 clock tai
# payload:a delay:9986 expected:10000 (us)
# payload:b delay:19807 expected:20000 (us)
# 
# SO_TXTIME ipv6 clock tai
# payload:b delay:9819 expected:10000 (us)
# payload:a delay:19820 expected:20000 (us)
# OK. All tests passed
ok 27 selftests: net: so_txtime.sh
# selftests: net: ipv6_flowlabel.sh
# TEST management
# [OK]   !(flowlabel_get(fd, 1, 255, 0))
# [OK]   !(flowlabel_put(fd, 1))
# [OK]   !(flowlabel_get(fd, 0x1FFFFF, 255, 1))
# [OK]   flowlabel_get(fd, 1, 255, 1)
# [OK]   flowlabel_get(fd, 1, 255, 0)
# [OK]   flowlabel_get(fd, 1, 255, 1)
# [OK]   !(flowlabel_get(fd, 1, 255, 1 | 2))
# [OK]   flowlabel_put(fd, 1)
# [OK]   flowlabel_put(fd, 1)
# [OK]   flowlabel_put(fd, 1)
# [OK]   !(flowlabel_put(fd, 1))
# [OK]   flowlabel_get(fd, 2, 1, 1)
# [OK]   !(flowlabel_get(fd, 2, 255, 1))
# [OK]   !(flowlabel_get(fd, 2, 1, 1))
# [OK]   flowlabel_put(fd, 2)
# [OK]   flowlabel_get(fd, 3, 3, 1)
# [OK]   !(flowlabel_get(fd, 3, 255, 0))
# [OK]   !(flowlabel_get(fd, 3, 1, 0))
# [OK]   flowlabel_get(fd, 3, 3, 0)
# [OK]   flowlabel_get(fd, 3, 3, 0)
# [OK]   !(flowlabel_get(fd, 3, 3, 0))
# [OK]   flowlabel_get(fd, 4, 2, 1)
# [OK]   flowlabel_get(fd, 4, 2, 0)
# [OK]   !(flowlabel_get(fd, 4, 2, 0))
# TEST datapath
# send no label: recv no label (auto off)
# sent without label
# recv without label
# send label
# sent with label 1
# recv with label 1
# TEST datapath (with auto-flowlabels)
# send no label: recv auto flowlabel
# sent without label
# recv with label 519329
# send label
# sent with label 1
# recv with label 1
# OK. All tests passed
ok 28 selftests: net: ipv6_flowlabel.sh
# selftests: net: tcp_fastopen_backup_key.sh
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# PASS
# all tests done
ok 29 selftests: net: tcp_fastopen_backup_key.sh
# selftests: net: fcnal-test.sh
# 'nettest' command not found; skipping tests
ok 30 selftests: net: fcnal-test.sh
# selftests: net: traceroute.sh
# SKIP: Could not run IPV6 test without traceroute6
# SKIP: Could not run IPV4 test without traceroute
# 
# Tests passed:   0
# Tests failed:   0
