Return-Path: <linux-kernel-owner@vger.kernel.org>
X-Original-To: lists+linux-kernel@lfdr.de
Delivered-To: lists+linux-kernel@lfdr.de
Received: from vger.kernel.org (vger.kernel.org [23.128.96.18])
	by mail.lfdr.de (Postfix) with ESMTP id 5CF3B39CE8E
	for <lists+linux-kernel@lfdr.de>; Sun,  6 Jun 2021 12:16:50 +0200 (CEST)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
        id S230139AbhFFKSV (ORCPT <rfc822;lists+linux-kernel@lfdr.de>);
        Sun, 6 Jun 2021 06:18:21 -0400
Received: from mga01.intel.com ([192.55.52.88]:54243 "EHLO mga01.intel.com"
        rhost-flags-OK-OK-OK-OK) by vger.kernel.org with ESMTP
        id S229465AbhFFKSU (ORCPT <rfc822;linux-kernel@vger.kernel.org>);
        Sun, 6 Jun 2021 06:18:20 -0400
IronPort-SDR: 16Pqi9wNIe+SG0uQxZaVhB3weMgY4vaRLNlAOKdxzd5M2IL7CU8M+LUHfsgVCbk7OyGjcppgME
 0mrOmtpMn7Og==
X-IronPort-AV: E=McAfee;i="6200,9189,10006"; a="225827009"
X-IronPort-AV: E=Sophos;i="5.83,253,1616482800"; 
   d="log'?scan'208";a="225827009"
Received: from fmsmga002.fm.intel.com ([10.253.24.26])
  by fmsmga101.fm.intel.com with ESMTP/TLS/ECDHE-RSA-AES256-GCM-SHA384; 06 Jun 2021 03:16:30 -0700
IronPort-SDR: ZyQFvQogiO3vmzWoEdi1zmqF+tcnncsbsITqZBn21UoEM8SsMo44Tgv5CNOlTakUz/4PpE7E2W
 suf6XBqQIyyw==
X-ExtLoop1: 1
X-IronPort-AV: E=Sophos;i="5.83,253,1616482800"; 
   d="log'?scan'208";a="484446194"
Received: from shbuild999.sh.intel.com (HELO localhost) ([10.239.147.94])

> Or at least add a big comment. It's not clear to me exactly _which_
> other fields are the ones that are so hot that the contention on
> mmap_sem then causes even more cacheline bouncing.
>
> For example, is it either
> 
>  (a) we *want* the mmap_sem to be in the first 128-byte region,
> because then when we get the mmap_sem, the other fields in that same
> cacheline are hot
> 
> OR
> 
>  (b) we do *not* want mmap_sem to be in the *second* 128-byte region,
> because there is something *else* in that region that is touched
> independently of mmap_sem that is very very hot and now you get even
> more bouncing?
> 
> but I can't tell which one it is.

Yes, it's better to get more details of which fields are hottest, 
and following are some perf data details. Let me know if more info
is needed.

* perf-stat: we see more cache-misses

  32158577 ±  7%      +9.0%   35060321 ±  6%  perf-stat.ps.cache-misses
  69612918 ±  6%     +11.2%   77382336 ±  5%  perf-stat.ps.cache-references


* perf profile: the 'mmap_lock' are the hottest, though the ratio from
  map/unmap has some difference from 72:24 to 52:45, and this is the part
  that I don't understand
  
  - old kernel (without commit 57efa1fe59)

    96.60%     0.19%  [kernel.kallsyms]   [k] down_write_killable                           -      -            
72.46% down_write_killable;vm_mmap_pgoff;ksys_mmap_pgoff;do_syscall_64;entry_SYSCALL_64_after_hwframe;__mmap
24.14% down_write_killable;__vm_munmap;__x64_sys_munmap;do_syscall_64;entry_SYSCALL_64_after_hwframe;__munmap

  - new kernel 

    96.60%     0.16%  [kernel.kallsyms]    [k] down_write_killable                           -      -            
51.85% down_write_killable;vm_mmap_pgoff;ksys_mmap_pgoff;do_syscall_64;entry_SYSCALL_64_after_hwframe;__mmap
44.74% down_write_killable;__vm_munmap;__x64_sys_munmap;do_syscall_64;entry_SYSCALL_64_after_hwframe;__munmap


* perf-c2c: The hotspots(HITM) for 2 kernels are different due to the
  data structure change

  - old kernel

    - first cacheline
	mmap_lock->count (75%)
	mm->mapcount (14%)

    - second cacheline
	mmap_lock->owner (97%)

  - new kernel

    mainly in the cacheline of 'mmap_lock'     

    mmap_lock->count (~2%)
    mmap_lock->owner (95%)
    
I also attached the reduced pah and perf-c2c log for further
check. (The absolute HITM events number can be ignored, as the
recording time for new/old kernel may be different)


> It would be great to have a comment in the code - and in the commit
> message - about exactly which fields are the criticial ones. Because I
> doubt it is 'write_protect_seq' itself that matters at all.
> 
> If it's "mmap_sem should be close to other commonly used fields",
> maybe we should just move mmap_sem upwards in the structure?

Ok, will add more comments if the patch is still fine with
the above updated info.

Thanks,
Feng

>               Linus

--tThc/1wpZn/ma/RB
Content-Type: text/plain; charset=us-ascii
Content-Disposition: attachment; filename="pah_new.log"


struct rw_semaphore {
	atomic_long_t              count;                /*     0     0 */

	/* XXX 8 bytes hole, try to pack */

	atomic_long_t              owner;                /*     8     0 */

	/* XXX 8 bytes hole, try to pack */

	struct optimistic_spin_queue osq;                /*    16     0 */

	/* XXX 4 bytes hole, try to pack */

	raw_spinlock_t             wait_lock;            /*    20     0 */

	/* XXX 4 bytes hole, try to pack */

	struct list_head           wait_list;            /*    24     0 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 16 */
	/* last cacheline: 40 bytes */
};

struct mm_struct {
	struct {
		struct vm_area_struct * mmap;            /*     0     8 */
		struct rb_root     mm_rb;                /*     8     8 */
		u64                vmacache_seqnum;      /*    16     8 */
		long unsigned int  (*get_unmapped_area)(struct file *, long unsigned int, long unsigned int, long unsigned int, long unsigned int); /*    24     8 */
		long unsigned int  mmap_base;            /*    32     8 */
		long unsigned int  mmap_legacy_base;     /*    40     8 */
		long unsigned int  mmap_compat_base;     /*    48     8 */
		long unsigned int  mmap_compat_legacy_base; /*    56     8 */
		/* --- cacheline 1 boundary (64 bytes) --- */
		long unsigned int  task_size;            /*    64     8 */
		long unsigned int  highest_vm_end;       /*    72     8 */
		pgd_t *            pgd;                  /*    80     8 */
		atomic_t           membarrier_state;     /*    88     4 */
		atomic_t           mm_users;             /*    92     4 */
		atomic_t           mm_count;             /*    96     4 */
		atomic_t           has_pinned;           /*   100     4 */
		seqcount_t         write_protect_seq;    /*   104     4 */

		/* XXX 4 bytes hole, try to pack */

		atomic_long_t      pgtables_bytes;       /*   112     8 */
		int                map_count;            /*   120     4 */
		spinlock_t         page_table_lock;      /*   124     4 */
		/* --- cacheline 2 boundary (128 bytes) --- */
		struct rw_semaphore mmap_lock;           /*   128    40 */
		struct list_head   mmlist;               /*   168    16 */
		long unsigned int  hiwater_rss;          /*   184     8 */
		/* --- cacheline 3 boundary (192 bytes) --- */
		long unsigned int  hiwater_vm;           /*   192     8 */
		long unsigned int  total_vm;             /*   200     8 */
		long unsigned int  locked_vm;            /*   208     8 */
		atomic64_t         pinned_vm;            /*   216     8 */
		long unsigned int  data_vm;              /*   224     8 */
		long unsigned int  exec_vm;              /*   232     8 */
		long unsigned int  stack_vm;             /*   240     8 */
		long unsigned int  def_flags;            /*   248     8 */
		/* --- cacheline 4 boundary (256 bytes) --- */
		spinlock_t         arg_lock;             /*   256     4 */

		/* XXX 4 bytes hole, try to pack */

		long unsigned int  start_code;           /*   264     8 */
		long unsigned int  end_code;             /*   272     8 */
		long unsigned int  start_data;           /*   280     8 */
		long unsigned int  end_data;             /*   288     8 */
		long unsigned int  start_brk;            /*   296     8 */
		long unsigned int  brk;                  /*   304     8 */
		long unsigned int  start_stack;          /*   312     8 */
		/* --- cacheline 5 boundary (320 bytes) --- */
		long unsigned int  arg_start;            /*   320     8 */
		long unsigned int  arg_end;              /*   328     8 */
		long unsigned int  env_start;            /*   336     8 */
		long unsigned int  env_end;              /*   344     8 */
		long unsigned int  saved_auxv[46];       /*   352   368 */
		/* --- cacheline 11 boundary (704 bytes) was 16 bytes ago --- */
		struct mm_rss_stat rss_stat;             /*   720    32 */
		struct linux_binfmt * binfmt;            /*   752     8 */
		mm_context_t       context;              /*   760   128 */
		/* --- cacheline 13 boundary (832 bytes) was 56 bytes ago --- */
		long unsigned int  flags;                /*   888     8 */
		/* --- cacheline 14 boundary (896 bytes) --- */
		struct core_state * core_state;          /*   896     8 */
		spinlock_t         ioctx_lock;           /*   904     4 */

		/* XXX 4 bytes hole, try to pack */

		struct kioctx_table * ioctx_table;       /*   912     8 */
		struct task_struct * owner;              /*   920     8 */
		struct user_namespace * user_ns;         /*   928     8 */
		struct file *      exe_file;             /*   936     8 */
		struct mmu_notifier_subscriptions * notifier_subscriptions; /*   944     8 */
		long unsigned int  numa_next_scan;       /*   952     8 */
		/* --- cacheline 15 boundary (960 bytes) --- */
		long unsigned int  numa_scan_offset;     /*   960     8 */
		int                numa_scan_seq;        /*   968     4 */
		atomic_t           tlb_flush_pending;    /*   972     4 */
		bool               tlb_flush_batched;    /*   976     1 */

		/* XXX 7 bytes hole, try to pack */

		struct uprobes_state uprobes_state;      /*   984     8 */
		atomic_long_t      hugetlb_usage;        /*   992     8 */
		struct work_struct async_put_work;       /*  1000    32 */
		/* --- cacheline 16 boundary (1024 bytes) was 8 bytes ago --- */
		u32                pasid;                /*  1032     4 */
	};                                               /*     0  1040 */

	/* XXX last struct has 4 bytes of padding */

	long unsigned int          cpu_bitmap[];         /*  1040     0 */

	/* size: 1040, cachelines: 17, members: 2 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 16 bytes */
};

--tThc/1wpZn/ma/RB
Content-Type: text/plain; charset=us-ascii
Content-Disposition: attachment; filename="pah_old.log"


struct rw_semaphore {
	atomic_long_t              count;                /*     0     0 */

	/* XXX 8 bytes hole, try to pack */

	atomic_long_t              owner;                /*     8     0 */

	/* XXX 8 bytes hole, try to pack */

	struct optimistic_spin_queue osq;                /*    16     0 */

	/* XXX 4 bytes hole, try to pack */

	raw_spinlock_t             wait_lock;            /*    20     0 */

	/* XXX 4 bytes hole, try to pack */

	struct list_head           wait_list;            /*    24     0 */

	/* size: 40, cachelines: 1, members: 5 */
	/* padding: 16 */
	/* last cacheline: 40 bytes */
};

struct mm_struct {
	struct {
		struct vm_area_struct * mmap;            /*     0     8 */
		struct rb_root     mm_rb;                /*     8     8 */
		u64                vmacache_seqnum;      /*    16     8 */
		long unsigned int  (*get_unmapped_area)(struct file *, long unsigned int, long unsigned int, long unsigned int, long unsigned int); /*    24     8 */
		long unsigned int  mmap_base;            /*    32     8 */
		long unsigned int  mmap_legacy_base;     /*    40     8 */
		long unsigned int  mmap_compat_base;     /*    48     8 */
		long unsigned int  mmap_compat_legacy_base; /*    56     8 */
		/* --- cacheline 1 boundary (64 bytes) --- */
		long unsigned int  task_size;            /*    64     8 */
		long unsigned int  highest_vm_end;       /*    72     8 */
		pgd_t *            pgd;                  /*    80     8 */
		atomic_t           membarrier_state;     /*    88     4 */
		atomic_t           mm_users;             /*    92     4 */
		atomic_t           mm_count;             /*    96     4 */
		atomic_t           has_pinned;           /*   100     4 */
		atomic_long_t      pgtables_bytes;       /*   104     8 */
		int                map_count;            /*   112     4 */
		spinlock_t         page_table_lock;      /*   116     4 */
		struct rw_semaphore mmap_lock;           /*   120    40 */
		/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
		struct list_head   mmlist;               /*   160    16 */
		long unsigned int  hiwater_rss;          /*   176     8 */
		long unsigned int  hiwater_vm;           /*   184     8 */
		/* --- cacheline 3 boundary (192 bytes) --- */
		long unsigned int  total_vm;             /*   192     8 */
		long unsigned int  locked_vm;            /*   200     8 */
		atomic64_t         pinned_vm;            /*   208     8 */
		long unsigned int  data_vm;              /*   216     8 */
		long unsigned int  exec_vm;              /*   224     8 */
		long unsigned int  stack_vm;             /*   232     8 */
		long unsigned int  def_flags;            /*   240     8 */
		spinlock_t         arg_lock;             /*   248     4 */

		/* XXX 4 bytes hole, try to pack */

		/* --- cacheline 4 boundary (256 bytes) --- */
		long unsigned int  start_code;           /*   256     8 */
		long unsigned int  end_code;             /*   264     8 */
		long unsigned int  start_data;           /*   272     8 */
		long unsigned int  end_data;             /*   280     8 */
		long unsigned int  start_brk;            /*   288     8 */
		long unsigned int  brk;                  /*   296     8 */
		long unsigned int  start_stack;          /*   304     8 */
		long unsigned int  arg_start;            /*   312     8 */
		/* --- cacheline 5 boundary (320 bytes) --- */
		long unsigned int  arg_end;              /*   320     8 */
		long unsigned int  env_start;            /*   328     8 */
		long unsigned int  env_end;              /*   336     8 */
		long unsigned int  saved_auxv[46];       /*   344   368 */
		/* --- cacheline 11 boundary (704 bytes) was 8 bytes ago --- */
		struct mm_rss_stat rss_stat;             /*   712    32 */
		struct linux_binfmt * binfmt;            /*   744     8 */
		mm_context_t       context;              /*   752   128 */
		/* --- cacheline 13 boundary (832 bytes) was 48 bytes ago --- */
		long unsigned int  flags;                /*   880     8 */
		struct core_state * core_state;          /*   888     8 */
		/* --- cacheline 14 boundary (896 bytes) --- */
		spinlock_t         ioctx_lock;           /*   896     4 */

		/* XXX 4 bytes hole, try to pack */

		struct kioctx_table * ioctx_table;       /*   904     8 */
		struct task_struct * owner;              /*   912     8 */
		struct user_namespace * user_ns;         /*   920     8 */
		struct file *      exe_file;             /*   928     8 */
		struct mmu_notifier_subscriptions * notifier_subscriptions; /*   936     8 */
		long unsigned int  numa_next_scan;       /*   944     8 */
		long unsigned int  numa_scan_offset;     /*   952     8 */
		/* --- cacheline 15 boundary (960 bytes) --- */
		int                numa_scan_seq;        /*   960     4 */
		atomic_t           tlb_flush_pending;    /*   964     4 */
		bool               tlb_flush_batched;    /*   968     1 */

		/* XXX 7 bytes hole, try to pack */

		struct uprobes_state uprobes_state;      /*   976     8 */
		atomic_long_t      hugetlb_usage;        /*   984     8 */
		struct work_struct async_put_work;       /*   992    32 */
		/* --- cacheline 16 boundary (1024 bytes) --- */
		u32                pasid;                /*  1024     4 */
	};                                               /*     0  1032 */

	/* XXX last struct has 4 bytes of padding */

	long unsigned int          cpu_bitmap[];         /*  1032     0 */

	/* size: 1032, cachelines: 17, members: 2 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 8 bytes */
};

--tThc/1wpZn/ma/RB
Content-Type: text/plain; charset=us-ascii
Content-Disposition: attachment; filename="c2c_new.log"

=================================================
            Trace Event Information              
=================================================
  Total records                     :     293248
  Locked Load/Store Operations      :       6171
  Load Operations                   :      52087
  Loads - uncacheable               :          0
  Loads - IO                        :          0
  Loads - Miss                      :          0
  Loads - no mapping                :        467
  Load Fill Buffer Hit              :      14960
  Load L1D hit                      :      17949
  Load L2D hit                      :        377
  Load LLC hit                      :      11861
